Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1025DAA169.PIC
      <edc:AdjustPoint edc:_addr="0x1F92C4A4" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F92C4B0" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="197" edc:access="----------------------------nnnn" edc:cname="SBT16RD3" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT16RD3" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F92C4B4" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F92C4B8" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="198" edc:access="----------------------------nnnn" edc:cname="SBT16WR3" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT16WR3" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F92C4BC" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F92C4C0" edc:_begin="0x18" edc:_end="0x1c" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="199" edc:access="nnnnnnnnnnnnnnnnnnnnnnr-nnnnn---" edc:cname="SBT16REG4" edc:desc="" edc:impl="0xfffffef8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000x-00000---" edc:name="SBT16REG4" edc:nzwidth="32" edc:por="0000000000000000000000x-00000---" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="" edc:mask="0x1f" edc:name="SIZE" edc:nzwidth="5"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PRI" edc:desc="" edc:mask="0x1" edc:name="PRI" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BASE" edc:desc="" edc:mask="0x3fffff" edc:name="BASE" edc:nzwidth="22"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F92C4C4" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F92C4D0" edc:_begin="0x1c" edc:_end="0x20" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="200" edc:access="----------------------------nnnn" edc:cname="SBT16RD4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT16RD4" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F92C4D4" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F92C4D8" edc:_begin="0x20" edc:_end="0x24" edc:_modsrc="DOS-EIP-00136_ssx_v1.Module" edc:_refcount="201" edc:access="----------------------------nnnn" edc:cname="SBT16WR4" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------1111" edc:name="SBT16WR4" edc:nzwidth="32" edc:por="----------------------------1111" ltx:memberofperipheral="">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GROUP0" edc:desc="" edc:mask="0x1" edc:name="GROUP0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP1" edc:desc="" edc:mask="0x1" edc:name="GROUP1" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP2" edc:desc="" edc:mask="0x1" edc:name="GROUP2" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GROUP3" edc:desc="" edc:mask="0x1" edc:name="GROUP3" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
  </edc:PhysicalSpace>
  <edc:PinList edc:ppsflavor="complex-grouped">
    <edc:Pin>
      <!--Pin 1-->
      <edc:VirtualPin edc:name="NC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 2-->
      <edc:VirtualPin edc:name="VBUS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 3-->
      <edc:VirtualPin edc:name="RF2"/>
      <edc:VirtualPin edc:name="SDA3"/>
      <edc:VirtualPin edc:name="RPF2" edc:ppsgroup="4" edc:ppsval="11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 4-->
      <edc:VirtualPin edc:name="RE1"/>
      <edc:VirtualPin edc:name="PMD1"/>
      <edc:VirtualPin edc:name="AN39"/>
      <edc:VirtualPin edc:name="EBID1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 5-->
      <edc:VirtualPin edc:name="RG15"/>
      <edc:VirtualPin edc:name="AN21"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 6-->
      <edc:VirtualPin edc:name="RF13"/>
      <edc:VirtualPin edc:name="SCK5"/>
      <edc:VirtualPin edc:name="AN17"/>
      <edc:VirtualPin edc:name="TDI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 7-->
      <edc:VirtualPin edc:name="RC3"/>
      <edc:VirtualPin edc:name="PMWR"/>
      <edc:VirtualPin edc:name="RPC3" edc:ppsgroup="3" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN34"/>
      <edc:VirtualPin edc:name="EBIWE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 8-->
      <edc:VirtualPin edc:name="RC2"/>
      <edc:VirtualPin edc:name="PMD12"/>
      <edc:VirtualPin edc:name="RPC2" edc:ppsgroup="4" edc:ppsval="12"/>
      <edc:VirtualPin edc:name="AN10"/>
      <edc:VirtualPin edc:name="EBID12"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 9-->
      <edc:VirtualPin edc:name="RB8"/>
      <edc:VirtualPin edc:name="PMD10"/>
      <edc:VirtualPin edc:name="RPB8" edc:ppsgroup="3" edc:ppsval="2"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="EBID10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 10-->
      <edc:VirtualPin edc:name="RB3"/>
      <edc:VirtualPin edc:name="RPB3" edc:ppsgroup="2" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 11-->
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="PMA5"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="EBIA5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 12-->
      <edc:VirtualPin edc:name="RB4"/>
      <edc:VirtualPin edc:name="C1INB"/>
      <edc:VirtualPin edc:name="AN2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 13-->
      <edc:VirtualPin edc:name="RB2"/>
      <edc:VirtualPin edc:name="RPB2" edc:ppsgroup="4" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="C2INB"/>
      <edc:VirtualPin edc:name="AN1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 14-->
      <edc:VirtualPin edc:name="D-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 15-->
      <edc:VirtualPin edc:name="VUSB3V3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 16-->
      <edc:VirtualPin edc:name="RE4"/>
      <edc:VirtualPin edc:name="PMD4"/>
      <edc:VirtualPin edc:name="AN18"/>
      <edc:VirtualPin edc:name="EBID4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 17-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 18-->
      <edc:VirtualPin edc:name="RG8"/>
      <edc:VirtualPin edc:name="SCL4"/>
      <edc:VirtualPin edc:name="RPG8" edc:ppsgroup="1" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2IND"/>
      <edc:VirtualPin edc:name="AN30"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 19-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 20-->
      <edc:VirtualPin edc:name="RC1"/>
      <edc:VirtualPin edc:name="PMD5"/>
      <edc:VirtualPin edc:name="RPC1" edc:ppsgroup="1" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN12"/>
      <edc:VirtualPin edc:name="EBID5"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 21-->
      <edc:VirtualPin edc:name="RC4"/>
      <edc:VirtualPin edc:name="PMRD"/>
      <edc:VirtualPin edc:name="RPC4" edc:ppsgroup="2" edc:ppsval="10"/>
      <edc:VirtualPin edc:name="AN19"/>
      <edc:VirtualPin edc:name="EBIOE"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 22-->
      <edc:VirtualPin edc:name="RB1"/>
      <edc:VirtualPin edc:name="CTED1"/>
      <edc:VirtualPin edc:name="RPB1" edc:ppsgroup="2" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN9"/>
      <edc:VirtualPin edc:name="PGEC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 23-->
      <edc:VirtualPin edc:name="RB15"/>
      <edc:VirtualPin edc:name="OCFB"/>
      <edc:VirtualPin edc:name="RPB15" edc:ppsgroup="3" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="C2INA"/>
      <edc:VirtualPin edc:name="AN3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 24-->
      <edc:VirtualPin edc:name="RA9"/>
      <edc:VirtualPin edc:name="AN27"/>
      <edc:VirtualPin edc:name="VREF-"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 25-->
      <edc:VirtualPin edc:name="RB9"/>
      <edc:VirtualPin edc:name="PMA7"/>
      <edc:VirtualPin edc:name="RPB9" edc:ppsgroup="1" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="LVDIN"/>
      <edc:VirtualPin edc:name="AN47"/>
      <edc:VirtualPin edc:name="EBIA7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 26-->
      <edc:VirtualPin edc:name="RB12"/>
      <edc:VirtualPin edc:name="AN6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 27-->
      <edc:VirtualPin edc:name="D+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 28-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 29-->
      <edc:VirtualPin edc:name="RH14"/>
      <edc:VirtualPin edc:name="INT0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 30-->
      <edc:VirtualPin edc:name="RE0"/>
      <edc:VirtualPin edc:name="PMD0"/>
      <edc:VirtualPin edc:name="EBID0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 31-->
      <edc:VirtualPin edc:name="RG9"/>
      <edc:VirtualPin edc:name="PMA2"/>
      <edc:VirtualPin edc:name="RPG9" edc:ppsgroup="4" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C2INC"/>
      <edc:VirtualPin edc:name="AN23"/>
      <edc:VirtualPin edc:name="EBIA2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 32-->
      <edc:VirtualPin edc:name="RF12"/>
      <edc:VirtualPin edc:name="RPF12" edc:ppsgroup="3" edc:ppsval="9"/>
      <edc:VirtualPin edc:name="AN31"/>
      <edc:VirtualPin edc:name="TDO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 33-->
      <edc:VirtualPin edc:name="RE7"/>
      <edc:VirtualPin edc:name="PMD7"/>
      <edc:VirtualPin edc:name="AN15"/>
      <edc:VirtualPin edc:name="EBID7"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 34-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 35-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 36-->
      <edc:VirtualPin edc:name="RA10"/>
      <edc:VirtualPin edc:name="AN28"/>
      <edc:VirtualPin edc:name="VREF+"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 37-->
      <edc:VirtualPin edc:name="RB10"/>
      <edc:VirtualPin edc:name="RPB10" edc:ppsgroup="1" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="CVREFOUT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 38-->
      <edc:VirtualPin edc:name="RB0"/>
      <edc:VirtualPin edc:name="CTED2"/>
      <edc:VirtualPin edc:name="RPB0" edc:ppsgroup="3" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="AN0"/>
      <edc:VirtualPin edc:name="PGED1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 39-->
      <edc:VirtualPin edc:name="RC13"/>
      <edc:VirtualPin edc:name="RPC13" edc:ppsgroup="2" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCI"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 40-->
      <edc:VirtualPin edc:name="RA7"/>
      <edc:VirtualPin edc:name="SQID3"/>
      <edc:VirtualPin edc:name="SDDATA3"/>
      <edc:VirtualPin edc:name="TRD3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 41-->
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="SDCD"/>
      <edc:VirtualPin edc:name="TMS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 42-->
      <edc:VirtualPin edc:name="USBID"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 43-->
      <edc:VirtualPin edc:name="RH4"/>
      <edc:VirtualPin edc:name="AN20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 44-->
      <edc:VirtualPin edc:name="RG7"/>
      <edc:VirtualPin edc:name="SDA4"/>
      <edc:VirtualPin edc:name="RPG7" edc:ppsgroup="2" edc:ppsval="1"/>
      <edc:VirtualPin edc:name="C1INC"/>
      <edc:VirtualPin edc:name="AN13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 45-->
      <edc:VirtualPin edc:name="RE9"/>
      <edc:VirtualPin edc:name="RPE9" edc:ppsgroup="3" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN26"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 46-->
      <edc:VirtualPin edc:name="RB6"/>
      <edc:VirtualPin edc:name="RPB6" edc:ppsgroup="4" edc:ppsval="5"/>
      <edc:VirtualPin edc:name="PGEC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 47-->
      <edc:VirtualPin edc:name="AVSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 48-->
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 49-->
      <edc:VirtualPin edc:name="VBAT"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 50-->
      <edc:VirtualPin edc:name="RB5"/>
      <edc:VirtualPin edc:name="RPB5" edc:ppsgroup="1" edc:ppsval="8"/>
      <edc:VirtualPin edc:name="AN45"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 51-->
      <edc:VirtualPin edc:name="RB7"/>
      <edc:VirtualPin edc:name="RPB7" edc:ppsgroup="3" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="AN46"/>
      <edc:VirtualPin edc:name="C1INA"/>
      <edc:VirtualPin edc:name="PGED2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 52-->
      <edc:VirtualPin edc:name="RC14"/>
      <edc:VirtualPin edc:name="T1CK"/>
      <edc:VirtualPin edc:name="RPC14" edc:ppsgroup="1" edc:ppsval="7"/>
      <edc:VirtualPin edc:name="SOSCO"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 53-->
      <edc:VirtualPin edc:name="RG14"/>
      <edc:VirtualPin edc:name="SQID2"/>
      <edc:VirtualPin edc:name="SDDATA2"/>
      <edc:VirtualPin edc:name="TRD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 54-->
      <edc:VirtualPin edc:name="RG13"/>
      <edc:VirtualPin edc:name="SQID0"/>
      <edc:VirtualPin edc:name="SDDATA0"/>
      <edc:VirtualPin edc:name="TRD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 55-->
      <edc:VirtualPin edc:name="RG12"/>
      <edc:VirtualPin edc:name="SQID1"/>
      <edc:VirtualPin edc:name="SDDATA1"/>
      <edc:VirtualPin edc:name="TRD1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 56-->
      <edc:VirtualPin edc:name="RA6"/>
      <edc:VirtualPin edc:name="SQICLK"/>
      <edc:VirtualPin edc:name="SDCK"/>
      <edc:VirtualPin edc:name="TRCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 57-->
      <edc:VirtualPin edc:name="RG6"/>
      <edc:VirtualPin edc:name="SCK2"/>
      <edc:VirtualPin edc:name="C1IND"/>
      <edc:VirtualPin edc:name="AN14"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 58-->
      <edc:VirtualPin edc:name="RE8"/>
      <edc:VirtualPin edc:name="RPE8" edc:ppsgroup="4" edc:ppsval="13"/>
      <edc:VirtualPin edc:name="AN25"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 59-->
      <edc:VirtualPin edc:name="RB11"/>
      <edc:VirtualPin edc:name="AN49"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 60-->
      <edc:VirtualPin edc:name="RJ3"/>
      <edc:VirtualPin edc:name="EBIA22"/>
      <edc:VirtualPin edc:name="GD20"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 61-->
      <edc:VirtualPin edc:name="RD14"/>
      <edc:VirtualPin edc:name="RPD14" edc:ppsgroup="1" edc:ppsval="11"/>
      <edc:VirtualPin edc:name="AN22"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 62-->
      <edc:VirtualPin edc:name="RB14"/>
      <edc:VirtualPin edc:name="SCK3"/>
      <edc:VirtualPin edc:name="AN29"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 63-->
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="AN24"/>
      <edc:VirtualPin edc:name="TCK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 64-->
      <edc:VirtualPin edc:name="RC12"/>
      <edc:VirtualPin edc:name="CLKI"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 65-->
      <edc:VirtualPin edc:name="RC15"/>
      <edc:VirtualPin edc:name="CLKO"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 66-->
      <edc:VirtualPin edc:name="RD4"/>
      <edc:VirtualPin edc:name="RPD4" edc:ppsgroup="3" edc:ppsval="4"/>
      <edc:VirtualPin edc:name="SQICS0"/>
      <edc:VirtualPin edc:name="SDCMD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 67-->
      <edc:VirtualPin edc:name="RD5"/>
      <edc:VirtualPin edc:name="RPD5" edc:ppsgroup="4" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="SQICS1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 68-->
      <edc:VirtualPin edc:name="RE5"/>
      <edc:VirtualPin edc:name="PMA6"/>
      <edc:VirtualPin edc:name="RPE5" edc:ppsgroup="2" edc:ppsval="6"/>
      <edc:VirtualPin edc:name="EBIA6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 69-->
      <edc:VirtualPin edc:name="DDRVREF"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 70-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 71-->
      <edc:VirtualPin edc:name="RE6"/>
      <edc:VirtualPin edc:name="PMD6"/>
      <edc:VirtualPin edc:name="AN16"/>
      <edc:VirtualPin edc:name="EBID6"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 72-->
      <edc:VirtualPin edc:name="RB13"/>
      <edc:VirtualPin edc:name="CTPLS"/>
      <edc:VirtualPin edc:name="AN48"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 73-->
      <edc:VirtualPin edc:name="RJ10"/>
      <edc:VirtualPin edc:name="EBIBS1"/>
      <edc:VirtualPin edc:name="GD18"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 74-->
      <edc:VirtualPin edc:name="RJ12"/>
      <edc:VirtualPin edc:name="EBIBS0"/>
      <edc:VirtualPin edc:name="GD9"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 75-->
      <edc:VirtualPin edc:name="RJ2"/>
      <edc:VirtualPin edc:name="AN32"/>
      <edc:VirtualPin edc:name="EBIRDY3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 76-->
      <edc:VirtualPin edc:name="RD15"/>
      <edc:VirtualPin edc:name="SCK6"/>
      <edc:VirtualPin edc:name="AN33"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 77-->
      <edc:VirtualPin edc:name="RJ5"/>
      <edc:VirtualPin edc:name="EBICS1"/>
      <edc:VirtualPin edc:name="HSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 78-->
      <edc:VirtualPin edc:name="RJ4"/>
      <edc:VirtualPin edc:name="EBICS0"/>
      <edc:VirtualPin edc:name="VSYNC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 79-->
      <edc:VirtualPin edc:name="RD1"/>
      <edc:VirtualPin edc:name="SCK1"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 80-->
      <edc:VirtualPin edc:name="RD2"/>
      <edc:VirtualPin edc:name="PMCS1"/>
      <edc:VirtualPin edc:name="PMA14"/>
      <edc:VirtualPin edc:name="RPD2" edc:ppsgroup="1" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBIA14"/>
      <edc:VirtualPin edc:name="GD10"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 81-->
      <edc:VirtualPin edc:name="RD3"/>
      <edc:VirtualPin edc:name="PMCS2"/>
      <edc:VirtualPin edc:name="PMA15"/>
      <edc:VirtualPin edc:name="RPD3" edc:ppsgroup="2" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBIA15"/>
      <edc:VirtualPin edc:name="GD11"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 82-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 83-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 84-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 85-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 86-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 87-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 88-->
      <edc:VirtualPin edc:name="RJ14"/>
      <edc:VirtualPin edc:name="PMD11"/>
      <edc:VirtualPin edc:name="EBID11"/>
      <edc:VirtualPin edc:name="GD8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 89-->
      <edc:VirtualPin edc:name="RJ6"/>
      <edc:VirtualPin edc:name="EBICS2"/>
      <edc:VirtualPin edc:name="GCLK"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 90-->
      <edc:VirtualPin edc:name="RJ13"/>
      <edc:VirtualPin edc:name="PMD13"/>
      <edc:VirtualPin edc:name="EBID13"/>
      <edc:VirtualPin edc:name="GD0"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 91-->
      <edc:VirtualPin edc:name="RJ7"/>
      <edc:VirtualPin edc:name="EBICS3"/>
      <edc:VirtualPin edc:name="GEN"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 92-->
      <edc:VirtualPin edc:name="RD9"/>
      <edc:VirtualPin edc:name="PMD15"/>
      <edc:VirtualPin edc:name="RPD9" edc:ppsgroup="3" edc:ppsval="0"/>
      <edc:VirtualPin edc:name="EBID15"/>
      <edc:VirtualPin edc:name="GD2"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 93-->
      <edc:VirtualPin edc:name="RD10"/>
      <edc:VirtualPin edc:name="SCK4"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 94-->
      <edc:VirtualPin edc:name="RD0"/>
      <edc:VirtualPin edc:name="RPD0" edc:ppsgroup="4" edc:ppsval="3"/>
      <edc:VirtualPin edc:name="RTCC"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 95-->
      <edc:VirtualPin edc:name="VSS1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 96-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 97-->
      <edc:VirtualPin edc:name="VDD1V8"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 98-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 99-->
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 100-->
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 101-->
      <edc:VirtualPin edc:name="RK4"/>
      <edc:VirtualPin edc:name="EBIA18"/>
      <edc:VirtualPin edc:name="GD13"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 102-->
      <edc:VirtualPin edc:name="RK2"/>
      <edc:VirtualPin edc:name="PMA3"/>
      <edc:VirtualPin edc:name="AN11"/>
      <edc:VirtualPin edc:name="EBIA3"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 103-->
      <edc:VirtualPin edc:name="RH2"/>
      <edc:VirtualPin edc:name="EBIRP"/>
      <edc:VirtualPin edc:name="SDWP"/>
    </edc:Pin>
    <edc:Pin>
      <!--Pin 104-->
      <edc:VirtualPin edc:name="RJ15"/>
      <edc:VirtualPin edc:name="PMA0"/>
      <edc:VirtualPin edc:name="EBIA0"/>
    </edc:Pin>
